app/controllers/admin/posts_controller.rb

SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "posts" SET "header" = $1, "created_at" = $2, "updated_at" = $3 WHERE "posts"."id" = $4  [["header", ""], ["created_at", "2021-07-01 00:00:00"], ["updated_at", "2021-07-30 14:33:57.390076"], ["id", 4]]
---
    def update
      post = Post.find(params[:id])
      if params[:post][:image_ids]
        params[:post][:image_ids].each do |image_id|
          image = post.images.find(image_id)
          image.purge
        end
      end
      respond_to do |format|
        if @post.update(post_params)