app/controllers/homepage_controller.rb

  def index
    @posts = Post.where(status: 'validated').order(:created_at)
---
SELECT "posts".* FROM "posts" WHERE "posts"."status" = $1 ORDER BY "posts"."created_at" ASC, created_at  [["status", "validated"]]