app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "content", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "Test"], ["content", "test"], ["created_at", "2021-07-30 08:48:14.859687"], ["updated_at", "2021-07-30 08:48:14.859687"]]
---
  def create
    @post = Post.new(post_params)

    respond_to do |format|
      if @post.save